<template lang="pug">
  div
    Header
    nuxt
    Footer(
      :seoLinks="seoLinks"
    )
</template>

<script>
import Header from './header.vue'
import Footer from './footer.vue'

export default {
  name: 'MainLayout',
  components: {
    Header,
    Footer
  },
  data() {
    return {
      seoLinks: {
        'Все для кровли:': [
          'Гибкая черепица',
          'Металлочерепица',
          'Керамическая черепица',
          'Изоляционные пленки',
          'Рулонная изоляция',
          'Водосточные системы',
          'Вентиляция кровли',
          'Композитная кровля',
          'Медная кровля',
          'Мансардные окна',
          'Ондулин',
          'Профнастил',
          'Сайдинг',
          'Фальцевая кровля',
          'Цементно-песчаная черепица',
          'Чердачные лестницы',
          'Шифер волновой',
          'Шифер плоский',
          'Элементы безопасности'
        ],
        'Древесно-плитные материалы:': [
          'OSB',
          'Плиты МДВП Белплит',
          'ЦСП Тамак',
          'ДСП',
          'ВДСПШ',
          'GREENBOARD',
          'Фанера',
          'ГСП',
          'ДВП',
          'Двутавровые балки',
          'ЛВЛ брус',
          'ЛДСП',
          'МДВП',
          'МДФ',
          'СИП панели',
          'СМЛ',
          'Элемент пола на основе UCG'
        ],
        'Теплозвукоизоляция:': [
          'Базовый-минеральный утеплитель',
          'Льняной утеплитель',
          'Эковата',
          'GREEN PLANET',
          'Вспенный полиэтилен',
          'Пенополистирол (пенопласт)',
          'Шелтерэкострой'
        ],
        'Металлопрокат:': [
          'Арматура',
          'Швеллер',
          'Полоса металлическая',
          'Лист металлический',
          'Уголок',
          'Балка двутаровая',
          'Трубный прокат',
          'Квадрат стальной',
          'Дополнительные материалы'
        ],
        'Электрика и освещение:': [
          'Автоматические выключатели',
          'Счетчики электроэнергии',
          'Электроустановочные изделия',
          'Удлинители',
          'Вентиляция',
          'Кабельная продукция',
          'Электрические щитки'
        ],
        'Отделочные материалы:': [
          'Сухие смеси',
          'Пены, герметики, клеи',
          'Стеновые панели',
          'Лакокрасочные материалы',
          'Потолочные системы',
          'Самоклеящаяся пленка',
          'Напольные покрытия',
          'Плитка, керамогранит, камень',
          'Фасадная доска'
        ],
        'Общестроительные материалы:': [
          'Портландцемент',
          'Цемент',
          'Пиломатериалы',
          'Гидроизоляция',
          'Газобетонные блоки',
          'ПГП Плиты',
          'Сетка металлическая',
          'Кирпич',
          'Мешки для мусора',
          'Подложки',
          'Подоконники',
          'Проволока вязальная',
          'Укрывные материалы'
        ],
        'Геоматериалы:': [
          'Агропленки',
          'Дренаж и системы водоотвода',
          'Полимерные мембраны'
        ],
        'Гипсокартон:': ['KNAUF', 'ВОЛМА', 'ГИПРОК', 'МАГМА', 'ПРОФИЛЬ'],
        'Крепеж:': [
          'Анкерный болт',
          'Гвозди',
          'Дюбельная техника',
          'Метрический крепеж',
          'Перфорированный крепеж',
          'Саморезы / шурупы'
        ],
        'Дача и сад:': [
          'Емкости для воды',
          'Садовая мебель',
          'Товары для пикника'
        ]
      }
    }
  },
  computed: {
    meta() {
      return [
        { charset: 'utf-8' },
        {
          name: 'viewport',
          content:
            'width=device-width, initial-scale=1, maximum-scale=1 shrink-to-fit=no'
        },
        {
          hid: 'description',
          name: 'description',
          content: 'Главная'
        }
      ]
    },
    head() {
      const canonical = `https://localhost:3000/${this.$route.path
        .toLowerCase()
        .replace(/\$/, '')}`
      return {
        meta: [...this.meta],
        link: [
          {
            rel: 'canonical',
            href: canonical
          }
        ]
      }
    }
  }
}
</script>
